[
    {
        "title": "API Keys vs Tokens",
        "ques": "What is the difference between an **API Key** and an **Access Token**?",
        "answer": {
            "type": "text",
            "content": "*   **API Key:** Identifies the **project** or application making the call. It's like a name badge for the app. Not secure for identifying users.\n*   **Access Token:** Identifies the **user** and their permissions. It tells the API *who* is making the request and *what* they are allowed to do."
        },
        "explanation": "Never use API keys for user authentication."
    },
    {
        "title": "Rate Limiting Security",
        "ques": "How does **Rate Limiting** enhance API security (beyond just saving resources)?",
        "answer": {
            "type": "text",
            "content": "**Rate Limiting** protects against **Denial of Service (DoS)** and **Brute Force** attacks.\n\nBy invalidating requests that exceed a threshold (e.g., 100 requests per minute), you prevent an attacker from overwhelming your server or trying millions of password combinations in seconds."
        },
        "explanation": "It's the bouncer at the door checking IDs slowly."
    },
    {
        "title": "CORS (Cross-Origin Resource Sharing)",
        "ques": "What is **CORS** and why does it exist?",
        "answer": {
            "type": "text",
            "content": "**CORS** is a browser security mechanism.\n\n**Purpose:** It prevents a malicious website (evil.com) from making requests to your API (bank.com) using the user's cookies without permission. The server must explicitly send a header (`Access-Control-Allow-Origin`) to tell the browser 'It is okay to allow this other site to talk to me'."
        },
        "explanation": "CORS errors are the most common source of frustration for frontend developers."
    },
    {
        "title": "HTTPS/TLS",
        "ques": "Why is **HTTPS** non-negotiable for modern APIs, especially those handling authentication?",
        "answer": {
            "type": "text",
            "content": "Without **HTTPS**, all data (including passwords and tokens) is sent in **plaintext**.\n\n**Risk:** Anyone on the same network (coffee shop Wi-Fi) can intercept and read this data (Man-in-the-Middle attack). HTTPS encrypts the traffic, making it unreadable to interceptors."
        },
        "explanation": "HTTP is like sending a postcard; HTTPS is like sending a locked armored truck."
    }
]