[
    {
        "title": "Python Syntax",
        "ques": "How does Python define code blocks (typically done with curly braces `{}` in other languages) and why is this significant?",
        "answer": {
            "type": "text",
            "content": "Python uses **Indentation (Whitespace)** to define code blocks.\n\n**Significance:** This enforces readability. If your indentation is inconsistent, the code will raise an `IndentationError` and fail to run. There are no `{}` or `begin/end` keywords."
        },
        "explanation": "This design choice forces clean code layout."
    },
    {
        "title": "Virtual Environments",
        "ques": "What is a **Virtual Environment** (`venv`) and why should you use one for every project?",
        "answer": {
            "type": "text",
            "content": "A **Virtual Environment** is an isolated directory containing a specific version of Python and a specific set of libraries.\n\n**Why:** It prevents dependency conflicts. Project A might need `Django 2.0` and Project B might need `Django 3.0`. Without virtual envs, installing one would break the other globally."
        },
        "explanation": "One project, one venv. This is the golden rule of Python development."
    },
    {
        "title": "Pip",
        "ques": "What does `pip install -r requirements.txt` do?",
        "answer": {
            "type": "text",
            "content": "It reads the `requirements.txt` file (which lists all project dependencies and their exact versions) and installs them all at once.\n\nThis ensures that other developers (or your production server) have the exact same environment as you."
        },
        "explanation": "`pip freeze > requirements.txt` creates this file."
    },
    {
        "title": "Decorators",
        "ques": "What is a **Decorator** in Python (syntax `@my_decorator`)?",
        "answer": {
            "type": "text",
            "content": "A **Decorator** is a function that takes another function as an argument and extends its behavior without explicitly modifying it.\n\n**Example:** In web frameworks like Flask, `@app.route('/')` registers the function below it as a handler for that URL."
        },
        "explanation": "Decorators are syntactic sugar for higher-order functions."
    }
]