[
    {
        "title": "Pipeline Purpose 🎯",
        "ques": "What is the primary goal of an automated pipeline in software development?",
        "answer": {
            "type": "text",
            "content": "To **automate** the path from code commit to production."
        },
        "explanation": "Pipelines reduce manual errors, speed up feedback, and ensure consistent deployment processes."
    },
    {
        "title": "Fast Feedback ⚡",
        "ques": "Why is it important for the initial stages of a pipeline (like unit tests) to be fast?",
        "answer": {
            "type": "text",
            "content": "To provide **immediate feedback** to developers."
        },
        "explanation": "Fast feedback loops allow developers to fix errors quickly before context switching or building on top of broken code."
    },
    {
        "title": "Parallel Execution 🛤️",
        "ques": "You have unit tests, linting, and security scans. How should they run to minimize total pipeline time?",
        "answer": {
            "type": "text",
            "content": "**In Parallel**"
        },
        "explanation": "Running independent tasks simultaneously (parallelism) significantly reduces the overall duration of the pipeline."
    },
    {
        "title": "Pipeline as Code 📝",
        "ques": "What is the benefit of defining your pipeline in a file (like `Jenkinsfile` or YAML) stored in the repo?",
        "answer": {
            "type": "text",
            "content": "**Versioning and Collaboration**"
        },
        "explanation": "\"Pipeline as Code\" allows the build process to be versioned, reviewed, and managed just like the application code."
    },
    {
        "title": "Gating 🚧",
        "ques": "What do we call a manual approval step required before a pipeline proceeds to a critical environment (like Production)?",
        "answer": {
            "type": "text",
            "content": "**Manual Gate** (or Approval)"
        },
        "explanation": "Manual gates serve as a safety check to ensure human verification before deploying to sensitive environments."
    }
]