[
    {
        "title": "Categorizing Design Patterns 📂",
        "ques": "Design patterns are typically categorized into three groups: **Creational**, **Structural**, and **Behavioral**. Match the following patterns to their category:\n1.  Singleton\n2.  Adapter\n3.  Observer",
        "answer": {
            "type": "text",
            "content": "1.  **Singleton:** Creational (Deals with object creation mechanisms).\n2.  **Adapter:** Structural (Deals with object composition and interface adaptation).\n3.  **Observer:** Behavioral (Deals with communication between objects)."
        },
        "explanation": "Understanding the **intent** of a pattern (creation, structure, or behavior) helps you choose the right tool for the job."
    },
    {
        "title": "Why Use Design Patterns? 🤷",
        "ques": "Design patterns are not code libraries; they are **concepts**. Why is it valuable for a team to know standard design patterns like 'Factory' or 'Strategy'?",
        "answer": {
            "type": "text",
            "content": "They provide a **shared vocabulary**. \nInstead of explaining a complex solution for 10 minutes, a developer can simply say \"I used a **Strategy** pattern here,\" and the team immediately understands the design intent, trade-offs, and structure."
        },
        "explanation": "Patterns are reusable solutions to common problems. They prevent re-inventing the wheel and improve code communication."
    },
    {
        "title": "Pattern vs. Anti-Pattern 🚫",
        "ques": "What defines an **Anti-Pattern**? Give a common example.",
        "answer": {
            "type": "text",
            "content": "*   **Anti-Pattern:** A common response to a recurring problem that is usually ineffective and risks being highly counterproductive.\n*   **Example:** The **God Object** (a class that knows too much or does too much). It violates the Single Responsibility Principle and is a nightmare to maintain."
        },
        "explanation": "Just because a solution is common doesn't mean it's good. Anti-patterns are 'traps' that look like solutions but create technical debt."
    },
    {
        "title": "Composition over Inheritance 🧩",
        "ques": "A core principle of design patterns is **\"Favor Composition over Inheritance\"**. Explain why.",
        "answer": {
            "type": "text",
            "content": "**Inheritance** creates a rigid, static relationship (is-a) that is decided at compile time. **Composition** (has-a) allows you to assemble behavior dynamically at runtime by plugging in different objects.\n\nComposition is generally more flexible and leads to less coupled code than deep inheritance hierarchies."
        },
        "explanation": "Many patterns (like Strategy, Decorator, Adapter) rely heavily on **composition** to achieve flexibility."
    },
    {
        "title": "The Gang of Four (GoF) 📚",
        "ques": "Who are the \"Gang of Four\" in the context of software engineering?",
        "answer": {
            "type": "text",
            "content": "They are the four authors (Erich Gamma, Richard Helm, Ralph Johnson, John Vlissides) of the seminal book **\"Design Patterns: Elements of Reusable Object-Oriented Software\"** (1994). This book formalized the concept of software design patterns."
        },
        "explanation": "This book is the bible of OOP design patterns. It cataloged the original 23 patterns that are still widely used today."
    }
]