[
    {
        "title": "CIA Triad 📐",
        "ques": "Web security relies on the **CIA Triad**. What do these three letters stand for?",
        "answer": {
            "type": "text",
            "content": "1.  **Confidentiality:** Ensuring data is accessible only to those authorized to see it.\n2.  **Integrity:** Ensuring data is accurate and has not been altered by unauthorized parties.\n3.  **Availability:** Ensuring data and services are available to authorized users when needed."
        },
        "explanation": "Every security control maps back to one of these three pillars. For example, **Encryption** protects Confidentiality, **Hashing** protects Integrity, and **DDoS Protection** ensures Availability."
    },
    {
        "title": "Threat vs. Vulnerability ⚠️",
        "ques": "Distinguish between a **Threat** and a **Vulnerability** in the context of web applications.",
        "answer": {
            "type": "text",
            "content": "*   **Vulnerability:** A weakness or flaw in the system (e.g., input field not sanitizing HTML).\n*   **Threat:** A potential event or actor that could exploit that weakness (e.g., a hacker trying to inject a script).\n\n**Risk** is the intersection where a Threat meets a Vulnerability."
        },
        "explanation": "You can't always control threats (hackers exist), but you can control vulnerabilities (patching your code)."
    },
    {
        "title": "Defense in Depth 🛡️",
        "ques": "Explain the concept of **Defense in Depth**. Why is one strong firewall not enough?",
        "answer": {
            "type": "text",
            "content": "**Defense in Depth** is the strategy of layering multiple defensive measures. If an attacker breaches one layer (e.g., the firewall), they still face others (e.g., authentication, encryption, least privilege access). One single control is a single point of failure."
        },
        "explanation": "It's like a castle: you have a moat, then a wall, then guards, then a locked door. No single defense is perfect."
    },
    {
        "title": "Principle of Least Privilege 🔑",
        "ques": "Your web app connects to a database. Should you use the database `root` (admin) account for this connection? Why or why not?",
        "answer": {
            "type": "text",
            "content": "**No.** You should strictly follow the **Principle of Least Privilege**. The web app should use a dedicated account that only has permissions to perform necessary actions (e.g., `SELECT`, `INSERT` on specific tables), not `DROP TABLE` or `GRANT` permissions."
        },
        "explanation": "If the web app is compromised (e.g., via SQL Injection), using a limited account minimizes the damage the attacker can do."
    },
    {
        "title": "Attack Surface 🌊",
        "ques": "What is meant by **Attack Surface**? How does removing unused features affect it?",
        "answer": {
            "type": "text",
            "content": "**Attack Surface** is the sum of all points (endpoints, inputs, ports) where an unauthorized user can try to enter or extract data. **Removing unused features** (e.g., disabling an old API version) reduces the attack surface, making the application more secure."
        },
        "explanation": "Less code means fewer potential bugs. Minimalist software design is inherently more secure."
    }
]