[
    {
        "title": "IIS (Internet Information Services)",
        "ques": "Which operating system is **IIS** tightly integrated with, and what is its primary graphical management tool?",
        "answer": {
            "type": "text",
            "content": "**OS:** Windows Server.\n\n**Tool:** **IIS Manager**.\n\nIIS is Microsoft's extensible web server. Unlike the text-file based configuration of Nginx/Apache (which you can use), IIS is heavily GUI-driven, though it can also be managed via PowerShell or the command line."
        },
        "explanation": "It powers most ASP.NET applications."
    },
    {
        "title": "Application Pools",
        "ques": "What is an **Application Pool** in IIS and how does it improve reliability?",
        "answer": {
            "type": "text",
            "content": "An **Application Pool** isolates one or more web applications into their own worker process (`w3wp.exe`).\n\n**Reliability:** If one application crashes (e.g., memory leak or fatal error), it only crashes its own pool. Other applications running in different pools on the same server are unaffected."
        },
        "explanation": "Always put critical apps in their own pool."
    },
    {
        "title": "Web.config",
        "ques": "What is the **web.config** file in the context of IIS?",
        "answer": {
            "type": "text",
            "content": "**web.config** is an XML file used to configure settings for an IIS application.\n\nIt handles things like connection strings, security settings, redirect rules (URL Rewrite module), and custom error pages, specific to the folder it resides in (hierarchical configuration)."
        },
        "explanation": "It works similarly to Apache's `.htaccess` but is XML-based."
    },
    {
        "title": "Windows Authentication",
        "ques": "IIS supports **Windows Authentication**. What is a common use case for this?",
        "answer": {
            "type": "text",
            "content": "**Intranet Applications.**\n\nIn a corporate environment using Active Directory, users can log in to their PC once, and IIS automatically authenticates them to internal web apps without asking for a password again (Integrated Windows Auth / Kerberos)."
        },
        "explanation": "Seamless single sign-on for corporate networks."
    }
]