[
    {
        "title": "The Viewport Meta Tag 📱",
        "ques": "What is the purpose of `<meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">`?",
        "answer": {
            "type": "text",
            "content": "It controls how the page is displayed on mobile devices. \nWithout it, mobile browsers will assume the page is a desktop site and \"zoom out\" to show the whole layout, making text unreadable. This tag tells the browser to match the screen's width."
        },
        "explanation": "This is the single line of code that enables **Responsive Design**. Without it, media queries (`@media`) may not behave as expected."
    },
    {
        "title": "Open Graph Protocol (OG) 🖼️",
        "ques": "You paste a link on Facebook/LinkedIn and it transforms into a card with an image and title. What meta tags control this?",
        "answer": {
            "type": "text",
            "content": "**Open Graph (OG)** tags.\n*   `og:title`\n*   `og:description`\n*   `og:image`\n*   `og:url`"
        },
        "explanation": "OG tags allow you to control how your content appears when shared on social media, treating your webpage like a rich object."
    },
    {
        "title": "Twitter Cards 🐦",
        "ques": "How do **Twitter Cards** relate to Open Graph tags?",
        "answer": {
            "type": "text",
            "content": "They serve the same purpose but specifically for Twitter (X). While Twitter accepts Open Graph tags as a fallback, using specific tags like `twitter:card` (summary, summary_large_image) gives you finer control over the presentation on their platform."
        },
        "explanation": "For maximum reach, implement both OG and Twitter Card tags."
    },
    {
        "title": "Robots Meta Tag 🤖",
        "ques": "What does `<meta name=\"robots\" content=\"noindex, nofollow\">` tell a search engine?",
        "answer": {
            "type": "text",
            "content": "1.  **noindex:** Do NOT show this page in search results.\n2.  **nofollow:** Do NOT follow the links on this page to find other pages.\n\nThis is useful for private pages like \"Thank You\" pages, Staging environments, or Admin panels."
        },
        "explanation": "This gives you page-level control over crawling, unlike `robots.txt` which gives directory-level control."
    },
    {
        "title": "Canonical Tag 👑",
        "ques": "You have the same product accessible at two URLs (`/shirt` and `/shirt?color=blue`). How does `<link rel=\"canonical\" ...>` prevent duplicate content issues?",
        "answer": {
            "type": "text",
            "content": "You add the canonical tag to the variant pages pointing to the \"master\" page: `<link rel=\"canonical\" href=\"/shirt\">`.\nThis tells Google: \"I know these look similar, but `/shirt` is the **original** source of truth. Ignore the others and consolidate ranking power to this one.\""
        },
        "explanation": "Canonical tags are essential for e-commerce sites to prevent SEO penalties for duplicate automated content."
    }
]