[
    {
        "title": "SEO Definition 🔍",
        "ques": "What is **SEO** and how does it differ from paid advertising (SEM)?",
        "answer": {
            "type": "text",
            "content": "*   **SEO (Search Engine Optimization):** The practice of optimizing content to rank higher in **organic** (unpaid) search engine results.\n*   **Difference:** Paid ads appear instantly but cost money per click. SEO takes time to build but provides \"free,\" sustainable traffic."
        },
        "explanation": "SEO is about understanding what people are searching for and creating content that answers those queries better than anyone else."
    },
    {
        "title": "Title Tags 🏷️",
        "ques": "The `<title>` tag is considered one of the most important on-page SEO factors. Why? Where does it appear?",
        "answer": {
            "type": "text",
            "content": "It appears as the **clickable headline** in search engine results pages (SERPs). It also appears in the browser tab.\nIt tells both the search engine and the user exactly what the page is about in one sentence."
        },
        "explanation": "A good title is descriptive, concise (under 60 chars), and includes the main keyword."
    },
    {
        "title": "Meta Description 📝",
        "ques": "Does the `<meta name=\"description\">` tag directly affect ranking? What is its primary purpose?",
        "answer": {
            "type": "text",
            "content": "**No**, Google has stated it does not use the description as a direct ranking signal. \n**Purpose:** It acts as the \"ad copy\" in the search results (the snippet below the link). A compelling description improves the **Click-Through Rate (CTR)**, which *is* a ranking factor."
        },
        "explanation": "Think of the Meta Description as your sales pitch to get the user to click your link instead of a competitor's."
    },
    {
        "title": "URL Structure 🔗",
        "ques": "Which URL is better for SEO and why?\n1.  `example.com/products/item?id=123`\n2.  `example.com/products/blue-denim-jacket`",
        "answer": {
            "type": "text",
            "content": "Option 2 is better.\n**Reason:** It is human-readable and contains relevant keywords (`blue`, `denim`, `jacket`). Search engines use URL words to understand page context."
        },
        "explanation": "Clean URLs are user-friendly strings that persist in history and are easier to share."
    },
    {
        "title": "Site Speed as a Ranking Factor ⚡",
        "ques": "Since 2010 (and more so with Core Web Vitals), Google uses **page speed** as a ranking signal. Why?",
        "answer": {
            "type": "text",
            "content": "Google prioritizes User Experience. Users (especially on mobile) bounce immediately if a page is slow. To serve its users the best results, Google penalizes slow sites and boosts fast ones."
        },
        "explanation": "Performance Optimization is SEO. You cannot rank #1 with a 10-second load time."
    }
]