[
    {
        "title": "Lighthouse Accessibility Audit 🏮",
        "ques": "When you run a Lighthouse Accessibility audit, it gives you a score out of 100. Does a score of 100 mean your site is fully accessible?",
        "answer": {
            "type": "text",
            "content": "**No.** Automated tools can only detect ~30-50% of accessibility issues (programmatic errors like missing alt text). \nThey cannot detect **usability** issues (e.g., does the alt text actually make sense? Is the navigation flow logical?). Manual testing is always required."
        },
        "explanation": "Automated tools are the starting point, not the finish line."
    },
    {
        "title": "WAVE Tool 👋",
        "ques": "What is the **WAVE** tool (Web Accessibility Evaluation Tool)? How does it visualize issues?",
        "answer": {
            "type": "text",
            "content": "WAVE is a browser extension that injects icons directly into your page to highlight issues visually. It places **Red Icons** on errors (like low contrast) and **Green Icons** on features (like valid ARIA labels), allowing you to see the accessibility layer over your UI."
        },
        "explanation": "It's excellent for visual debugging of semantic structure and labeling."
    },
    {
        "title": "Screen Reader Testing 🗣️",
        "ques": "Name two common **Screen Readers** utilized for manual testing on different operating systems.",
        "answer": {
            "type": "text",
            "content": "1.  **NVDA** (Windows, Free, Open Source)\n2.  **VoiceOver** (macOS/iOS, Built-in)\n3.  **JAWS** (Windows, Commercial standard)"
        },
        "explanation": "Testing with a real screen reader reveals issues that no code linter can find (e.g., mispronounced words, confusing reading order)."
    },
    {
        "title": "Keyboard Traps 🕸️",
        "ques": "What is a **Keyboard Trap**? How do you test for it?",
        "answer": {
            "type": "text",
            "content": "A Keyboard Trap occurs when a user tabs into a component (like a modal or a custom widget) but cannot tab **out** of it. \n**Test:** Tab through every interactive element on the page. If you get stuck anywhere and can't leave without using a mouse, it's a trap."
        },
        "explanation": "This is a critical failure (WCAG 2.1.2) as it completely blocks keyboard users."
    },
    {
        "title": "Color Blindness Simulators 👁️",
        "ques": "Why should you use a **Color Blindness Simulator** during the design phase?",
        "answer": {
            "type": "text",
            "content": "To ensure that information is not conveyed **only** through color. \n*   *Example:* A form error shown only with a red border might look gray to a deuteranope. You must add an icon or text label."
        },
        "explanation": "Ensure distinctness relying on contrast and shape, not just hue."
    }
]