[
    {
        "title": "Elastic Compute Cloud (EC2) 💻",
        "ques": "Which AWS service provides resizable compute capacity (virtual servers) in the cloud?",
        "answer": {
            "type": "text",
            "content": "**Amazon EC2**"
        },
        "explanation": "EC2 allows you to run virtual machines (instances) with various configurations of CPU, memory, and storage."
    },
    {
        "title": "Simple Storage Service (S3) 🪣",
        "ques": "You need to store an unlimited amount of unstructured data (images, videos, backups). Which service should you use?",
        "answer": {
            "type": "text",
            "content": "**Amazon S3**"
        },
        "explanation": "S3 is an object storage service offering industry-leading scalability, data availability, security, and performance."
    },
    {
        "title": "AWS Lambda ⚡",
        "ques": "Which service lets you run code without provisioning or managing servers (Serverless Computing)?",
        "answer": {
            "type": "text",
            "content": "**AWS Lambda**"
        },
        "explanation": "Lambda runs your code in response to events and automatically manages the underlying compute resources."
    },
    {
        "title": "Relational Database Service (RDS) 🗄️",
        "ques": "You need a managed relational database like MySQL or PostgreSQL. Which service handles updates, backups, and scaling for you?",
        "answer": {
            "type": "text",
            "content": "**Amazon RDS**"
        },
        "explanation": "RDS simplifies setting up, operating, and scaling a relational database in the cloud."
    },
    {
        "title": "Regions and Availability Zones 🌍",
        "ques": "What is the term for a distinct geographic area (e.g., us-east-1) that contains multiple isolated locations (Availability Zones)?",
        "answer": {
            "type": "text",
            "content": "**Region**"
        },
        "explanation": "AWS infrastructure is built around Regions and Availability Zones to provide fault tolerance and low latency."
    }
]