[
    {
        "title": "Virtual Machines 🖥️",
        "ques": "What is the Azure equivalent of AWS EC2 for running virtualized servers?",
        "answer": {
            "type": "text",
            "content": "**Azure Virtual Machines**"
        },
        "explanation": "Azure VMs give you the flexibility of virtualization for a wide range of computing solutions."
    },
    {
        "title": "Blob Storage ☁️",
        "ques": "Which Azure service is optimized for storing massive amounts of unstructured data, such as text or binary data?",
        "answer": {
            "type": "text",
            "content": "**Azure Blob Storage**"
        },
        "explanation": "Blob Storage is designed for serving images, documents, streaming video, and performing big data analysis."
    },
    {
        "title": "Azure Functions ⚡",
        "ques": "What is Microsoft's serverless compute service that enables you to run event-triggered code without having to explicitly provision infrastructure?",
        "answer": {
            "type": "text",
            "content": "**Azure Functions**"
        },
        "explanation": "Azure Functions allows you to build applications faster by handling the infrastructure for you."
    },
    {
        "title": "Azure SQL Database 🗄️",
        "ques": "Which fully managed Platform as a Service (PaaS) database engine handles most of the database management functions like upgrading and patching?",
        "answer": {
            "type": "text",
            "content": "**Azure SQL Database**"
        },
        "explanation": "Azure SQL Database is a general-purpose relational database service based on the latest stable version of Microsoft SQL Server."
    },
    {
        "title": "Resource Groups 📂",
        "ques": "What is the logical container in Azure that holds related resources for an Azure solution?",
        "answer": {
            "type": "text",
            "content": "**Resource Group**"
        },
        "explanation": "Resource Groups help you manage and organize your Azure resources. You can deploy, update, and delete all resources in a group in a single operation."
    }
]