[
    {
        "title": "Compute Engine 🖥️",
        "ques": "What is Google Cloud's Infrastructure-as-a-Service (IaaS) offering that lets you create and run virtual machines?",
        "answer": {
            "type": "text",
            "content": "**Compute Engine**"
        },
        "explanation": "Compute Engine delivers virtual machines running in Google's innovative data centers and worldwide fiber network."
    },
    {
        "title": "Cloud Storage 🪣",
        "ques": "Which service offers unified object storage for developers and enterprises, capable of storing any amount of data?",
        "answer": {
            "type": "text",
            "content": "**Cloud Storage**"
        },
        "explanation": "Cloud Storage provides worldwide, highly durable object storage that scales to exabytes of data."
    },
    {
        "title": "Cloud Functions ⚡",
        "ques": "What is Google Cloud's lightweight, event-based, asynchronous compute solution (Serverless)?",
        "answer": {
            "type": "text",
            "content": "**Cloud Functions**"
        },
        "explanation": "Cloud Functions allows you to create single-purpose, stand-alone functions that respond to cloud events without managing servers."
    },
    {
        "title": "BigQuery 📊",
        "ques": "Which fully managed, serverless data warehouse enables super-fast SQL queries using the processing power of Google's infrastructure?",
        "answer": {
            "type": "text",
            "content": "**BigQuery**"
        },
        "explanation": "BigQuery is designed for analyzing data volume at the petabyte scale with high speed and zero operational overhead."
    },
    {
        "title": "App Engine 🚀",
        "ques": "What is the fully managed Platform-as-a-Service (PaaS) for building and deploying web applications and mobile backends?",
        "answer": {
            "type": "text",
            "content": "**App Engine**"
        },
        "explanation": "App Engine allows you to focus on writing code while Google manages the infrastructure availability and scaling."
    }
]