[
    {
        "title": "Function as a Service (FaaS) ⚡",
        "ques": "What model of cloud computing allows customers to develop, run, and manage application functionalities without the complexity of building and maintaining the infrastructure?",
        "answer": {
            "type": "text",
            "content": "**Serverless (or FaaS)**"
        },
        "explanation": "In FaaS, the cloud provider manages the allocation and execution of server resources spontaneously."
    },
    {
        "title": "Event-Driven Architecture 🔔",
        "ques": "In a serverless app, functions are typically triggered by ____ (e.g., file upload, database update, HTTP request).",
        "answer": {
            "type": "text",
            "content": "**Events**"
        },
        "explanation": "Serverless functions are idle until an event triggers them to run."
    },
    {
        "title": "API Gateway 🚪",
        "ques": "Which service creates, publishes, maintains, monitors, and secures APIs at any scale, acting as a \"front door\" for applications?",
        "answer": {
            "type": "text",
            "content": "**API Gateway**"
        },
        "explanation": "API Gateway handles all the specific tasks involved in accepting and processing up to hundreds of thousands of concurrent API calls."
    },
    {
        "title": "Pay-as-you-go 💸",
        "ques": "What is the primary billing advantage of serverless functions like AWS Lambda?",
        "answer": {
            "type": "text",
            "content": "**Pay only for compute time used**"
        },
        "explanation": "You are not charged when your code is not running (i.e., no charge for idle time)."
    },
    {
        "title": "Cold Starts 🥶",
        "ques": "What is the term for the slight latency experienced when a serverless function is invoked for the first time or after a period of inactivity?",
        "answer": {
            "type": "text",
            "content": "**Cold Start**"
        },
        "explanation": "Latency occurs while the provider provisions the runtime container before executing the function code."
    }
]