[
    {
        "title": "Object Storage 🗃️",
        "ques": "Which type of cloud storage is best suited for storing vast amounts of unstructured data like photos, videos, and backups (e.g., S3)?",
        "answer": {
            "type": "text",
            "content": "**Object Storage**"
        },
        "explanation": "Object storage manages data as objects, as opposed to file systems (hierarchy) or block storage (sectors)."
    },
    {
        "title": "Block Storage 🧱",
        "ques": "Which type of storage acts like a hard drive attached to a virtual server (e.g., AWS EBS)?",
        "answer": {
            "type": "text",
            "content": "**Block Storage**"
        },
        "explanation": "Block storage provides low-latency, reliable performance required by databases and OS boot volumes."
    },
    {
        "title": "Content Delivery Network (CDN) 🌍",
        "ques": "Which service speeds up the distribution of static web content to users by caching it in edge locations around the world?",
        "answer": {
            "type": "text",
            "content": "**CDN (e.g., CloudFront)**"
        },
        "explanation": "CDNs minimize latency by serving content from a server physically closer to the user."
    },
    {
        "title": "Managed Databases 🛠️",
        "ques": "What is the main benefit of using a Managed Database Service (like RDS) over installing a database on a VM?",
        "answer": {
            "type": "text",
            "content": "**Automated Administration**"
        },
        "explanation": "The provider handles backups, patching, failure detection, and recovery, allowing you to focus on your app."
    },
    {
        "title": "NoSQL 🍃",
        "ques": "For applications requiring high-scale, low-latency data access with flexible schemas (like DynamoDB), which database type is used?",
        "answer": {
            "type": "text",
            "content": "**NoSQL**"
        },
        "explanation": "NoSQL databases are built for specific data models and have flexible schemas for building modern applications."
    }
]