[
    {
        "title": "Validating with PropTypes",
        "ques": "What is the purpose of the `prop-types` library in React, and how does it help development?",
        "answer": {
            "type": "text",
            "content": "**PropTypes** is a runtime type-checking library for React props.\n\n**Purpose:** It allows you to define the expected type (string, number, array, etc.) and requirement (isRequired) for each prop passed to a component. If a component receives the wrong type, React logs a warning in the console, helping catch bugs early."
        },
        "explanation": "While TypeScript has largely replaced PropTypes in modern projects, it remains a standard tool in pure JavaScript React codebases."
    },
    {
        "title": "Default Props",
        "ques": "How do you define **default values** for props in a functional component so that they have a value even if the parent doesn't pass one?",
        "answer": {
            "type": "code",
            "lang": "javascript",
            "content": "// modern way using destructuring default values\nfunction Button({ color = 'blue', text }) {\n  return <button className={color}>{text}</button>;\n}\n\n// Usage: <Button text=\"Submit\" /> will render a blue button."
        },
        "explanation": "Default parameters in destructuring are the cleanest way to handle optional props."
    },
    {
        "title": "The Problem of Prop Drilling",
        "ques": "Explain **Prop Drilling** and why it can become a problem in large applications.",
        "answer": {
            "type": "text",
            "content": "**Prop Drilling** occurs when you need to pass data from a top-level component down to a deeply nested child component.\n\n**Problem:** You have to pass the props through every intermediate component in the tree, even if those intermediate components don't use the data themselves. This makes the code cluttered and components tightly coupled to data they don't need."
        },
        "explanation": "Prop drilling is often the signal that you need a better state management solution like Context or Redux."
    },
    {
        "title": "Controlled Components",
        "ques": "In React forms, what is a **Controlled Component**?",
        "answer": {
            "type": "text",
            "content": "A **Controlled Component** is an input form element (like `<input>`, `<textarea>`) whose value is controlled by React **state**.\n\n**Mechanism:**\n1.  The `value` prop is set to a state variable.\n2.  The `onChange` handler updates that state variable.\n\nThis makes the React state the 'single source of truth' for the input's value, rather than the DOM."
        },
        "explanation": "Controlled components allow you to validate input, mask values, or conditionally disable submission instantly."
    }
]