[
    {
        "title": "Responsive vs. Adaptive 🆚",
        "ques": "Compare **Responsive Design** and **Adaptive Design**. Which one uses fluid grids and which one uses distinct layouts for specific devices?",
        "answer": {
            "type": "text",
            "content": "*   **Responsive:** Uses **fluid grids** (percentages) and media queries. The content reshapes itself to fit *any* screen size smoothly.\n*   **Adaptive:** Uses **fixed layouts** for multiple distinct screen sizes (e.g., a specific 320px layout for iPhone, a 768px layout for Tablet). It snaps to the best fit."
        },
        "explanation": "Responsive is the modern standard (one codebase, infinite sizes). Adaptive is older but sometimes used for radically different experiences."
    },
    {
        "title": "Viewport Meta Tag 📱",
        "ques": "What specific problem does `<meta name=\"viewport\" content=\"width=device-width\">` solve on mobile browsers?",
        "answer": {
            "type": "text",
            "content": "Before smartphones, the web was desktop-only. Early iPhones rendered pages at ~980px wide and zoomed out. \nThis tag tells the browser: \"Do not zoom out. Set the viewport width to the actual device width (e.g., 375px) so the CSS media queries work correctly.\""
        },
        "explanation": "Without this, your media query `@media (max-width: 600px)` effectively never triggers on a phone."
    },
    {
        "title": "Touch Targets 👆",
        "ques": "According to Apple and Google guidelines, what is the minimum recommended size for a tappable touch target (like a button) to be usable?",
        "answer": {
            "type": "text",
            "content": "Approximately **44x44 points** (iOS) or **48x48 dp** (Android). \nPhysical size matters. Buttons smaller than this frustrates users with \"Fat Finger\" syndrome, causing missed taps."
        },
        "explanation": "Accessibility isn't just about blindness; it's about motor control too. Small buttons are an accessibility failure."
    },
    {
        "title": "The Hover Interaction 🖱️",
        "ques": "Why should you never rely on the `:hover` pseudo-class for critical functionality in a mobile-integrated web app?",
        "answer": {
            "type": "text",
            "content": "There is no \"hover\" on a touchscreen. \nIf you hide the \"Edit\" button until the user hovers over a row, a mobile user will **never** be able to see or use that button."
        },
        "explanation": "Always design for \"Touch First\". Hover effects should be purely cosmetic."
    },
    {
        "title": "Hamburger Menu 🍔",
        "ques": "The \"Hamburger\" icon is ubiquitous for mobile navigation. What is a common usability criticism of this pattern?",
        "answer": {
            "type": "text",
            "content": "It hides navigation options behind a click (Low **Discoverability**). \nUsers don't know what features exist until they dig. A **Bottom Tab Bar** is often preferred for core app sections because the options are always visible."
        },
        "explanation": "Out of sight, out of mind. Use hamburgers for secondary settings, not primary actions."
    }
]