[
    {
        "title": "The Bridge Concept 🌉",
        "ques": "React Native uses JavaScript to control native iOS/Android components. How does the JS talk to the Native side? Explain the **Bridge**.",
        "answer": {
            "type": "text",
            "content": "The **Bridge** allows asynchronous communication. \nJavaScript sends JSON messages across the bridge (serialized). The Native side receives them and performs the UI update (e.g., \"Draw a Button at x:10, y:20\"). \n(Note: The new Fabric architecture removes the bridge for C++ bindings)."
        },
        "explanation": "This allows you to write JS but get real Native UI, not a Web View."
    },
    {
        "title": "View System 🖼️",
        "ques": "In React Native, you use `<View>` and `<Text>` instead of `<div>` and `<span>`. Why?",
        "answer": {
            "type": "text",
            "content": "Because `<div>` is an HTML concept. \nAndroid/iOS don't understand HTML. `<View>` is an abstraction that maps to `UIView` on iOS and `android.view.View` on Android. React Native compiles these abstractions to their platform-specific native equivalents."
        },
        "explanation": "Write once, render natively everywhere."
    },
    {
        "title": "Styling: Flexbox 📦",
        "ques": "React Native uses a subset of CSS. What is the primary layout engine used?",
        "answer": {
            "type": "text",
            "content": "**Flexbox** (via the Yoga engine). \nIt works almost exactly like CSS Flexbox (defaulting to `flex-direction: column`). It ensures layouts scale correctly across different screen densities and sizes without hardcoded pixels."
        },
        "explanation": "If you know Web CSS Flexbox, you know React Native layout."
    },
    {
        "title": "Native Modules 🔌",
        "ques": "What is a **Native Module**? When would you need to write one?",
        "answer": {
            "type": "text",
            "content": "A Native Module is custom Java/Swift code that exposes a native platform API to JavaScript. \nYou write one when React Native doesn't support a specific feature out of the box (e.g., a specific payment SDK or image processing library)."
        },
        "explanation": "This is the escape hatch. You are never limited by JS; you can always drop down to native code."
    },
    {
        "title": "Hot Reloading 🔥",
        "ques": "How does **Fast Refresh** (Hot Reloading) improve the mobile development experience compared to traditional Native dev?",
        "answer": {
            "type": "text",
            "content": "In traditional native (Swift/Java), you must re-compile the app for every change (taking 1-5 minutes). \nIn React Native, JS changes are injected instantly (sub-second) into the running app without losing state, mimicking the web dev speed."
        },
        "explanation": "This rapid feedback loop is React Native's biggest selling point."
    }
]