[
    {
        "title": "Vector Editing in Adobe XD",
        "ques": "Adobe XD is a **vector-based** tool. What does this mean, and what is its primary advantage for UI design compared to raster tools?",
        "answer": {
            "type": "text",
            "content": "Being **vector-based** means that graphics in Adobe XD are defined by mathematical paths (lines, curves, and points) rather than a grid of pixels.\n\n**Advantage:**\n*   **Scalability:** You can resize UI elements (icons, buttons, screens) infinitely without losing quality or pixelating. This is essential for designing for various screen sizes (mobile, tablet, desktop) and high-resolution displays."
        },
        "explanation": "Modern UI design relies heavily on vector graphics for crisp rendering across all devices."
    },
    {
        "title": "Interactive Prototypes",
        "ques": "How does the **Auto-Animate** feature in Adobe XD facilitate creating interactive prototypes?",
        "answer": {
            "type": "text",
            "content": "**Auto-Animate** in Adobe XD interpolates the differences between element properties on two different artboards.\n\n**Process:** When you connect two artboards and select 'Auto-Animate', XD detects elements with the same name and group structure. It then smoothly transitions their properties (position, scale, opacity) from the start state to the end state. This allows for creating seamless animations like drag gestures, menu expansions, and component state changes."
        },
        "explanation": "Auto-Animate was a game-changer when introduced, allowing designers to prototype complex motion simply by designing the start and end states."
    },
    {
        "title": "Developer Handoff",
        "ques": "Explain the **Share for Development** workflow in Adobe XD. What information can developers extract from it?",
        "answer": {
            "type": "text",
            "content": "**Share for Development** generates a web link where developers can inspect the design files.\n\n**Extracted Information:**\n1.  **CSS/Code Snippets:** Developers can see CSS, Swift, or Android XML code for styling.\n2.  **Assets:** They can download exported assets (images, icons) directly.\n3.  **Measurements:** They can hover over elements to see exact dimensions, margins, and padding values."
        },
        "explanation": "Effective handoff bridges the gap between design and code. XD's integrated sharing features streamline this communication."
    },
    {
        "title": "Content-Aware Layout (Padding)",
        "ques": "What is **Padding** in Adobe XD's layout controls, and how does it help in creating responsive components like buttons?",
        "answer": {
            "type": "text",
            "content": "**Padding** controls define a fixed amount of space between a group's background and its content.\n\n**Benefit:** When enabled on a button group (background rectangle + text), changing the text length will automatically resize the background rectangle to maintain the specified padding. This makes components smart and adaptable without manual resizing."
        },
        "explanation": "This feature (conceptually similar to Auto Layout in Figma) saves time when managing design systems with variable content."
    }
]