[
    {
        "title": "Understanding UI vs. UX Design",
        "ques": "Explain the **primary difference** between User Interface (UI) Design and User Experience (UX) Design. Provide one example of a task associated with each field.",
        "answer": {
            "type": "text",
            "content": "* **User Interface (UI) Design:** Focuses on the **visual look and feel** of a product. It involves designing screens, buttons, icons, and typography.\n    *   *Example Task:* Choosing the color scheme and font for a mobile app's login screen.\n* **User Experience (UX) Design:** Focuses on the **overall feel and usability** of the product. It involves understanding user needs, creating flows, and ensuring the product is easy to use.\n    *   *Example Task:* Conducting user interviews to understand pain points in the current checkout process."
        },
        "explanation": "This exercise clarifies the fundamental distinction: **UI** is about the surface (visuals), while **UX** is about the structure and the journey (usability and logic)."
    },
    {
        "title": "Wireframing Basics",
        "ques": "What is a **wireframe** in the context of web and app design, and **why** is it an essential step before creating high-fidelity designs?",
        "answer": {
            "type": "text",
            "content": "A **wireframe** is a low-fidelity visual guide that represents the skeletal framework of a website or application. It outlines the structure and layout without focusing on design elements like colors or images.\n\n**Why it is essential:**\n1.  **Focus on Layout:** It allows designers and stakeholders to agree on the placement of elements and information architecture without being distracted by aesthetics.\n2.  **Rapid Iteration:** Wireframes are quick to create and change, making it easy to test multiple layout ideas early in the process.\n3.  **Clarity:** It ensures all necessary functionality and content are accounted for before investing time in detailed design."
        },
        "explanation": "Wireframing is the blueprint phase. Skipping it often leads to costly design changes later because the core structure wasn't validated first."
    },
    {
        "title": "Prototyping Fundamentals",
        "ques": "Define **prototyping** and explain the difference between **low-fidelity** and **high-fidelity** prototypes.",
        "answer": {
            "type": "text",
            "content": "*   **Prototyping:** The process of creating an interactive simulation of the final product to test user flows and interactions.\n*   **Low-Fidelity Prototypes:** simple, often paper-based or basic digital sketches (like clickable wireframes). They are quick to build and used to test broad concepts and user flows.\n*   **High-Fidelity Prototypes:** highly detailed simulations that look and function very closely to the final product. They include final colors, images, and interactions, used for detailed usability testing and stakeholder presentation."
        },
        "explanation": "Prototyping brings static designs to life. Understanding the fidelity spectrum helps in choosing the right tool for the right stage of the design process."
    },
    {
        "title": "The Role of User Research",
        "ques": "Why is **user research** critical in the UX design process? List two common methods used to conduct user research.",
        "answer": {
            "type": "text",
            "content": "**User Research** is critical because it grounds design decisions in real data rather than assumptions. It helps designers understand the target audience's needs, behaviors, and pain points, leading to a product that solves actual problems.\n\n**Common Methods:**\n1.  **User Interviews:** One-on-one sessions to gather qualitative insights about user experiences and motivations.\n2.  **Surveys:** Questionnaires sent to a larger group to gather quantitative data about user preferences and demographics."
        },
        "explanation": "User research is the foundation of user-centered design. Without it, you are essentially designing in the dark."
    }
]