[
    {
        "title": "Interface Design in Figma",
        "ques": "In Figma, how do **Frames** differ from **Groups**, and why are Frames generally preferred for interface design?",
        "answer": {
            "type": "text",
            "content": "**Frames** in Figma are more powerful than simple Groups. Unlike Groups, Frames:\n1.  **Have their own canvas properties:** They can have background colors, grids, and clips content (masking).\n2.  **Support Constraints and Auto Layout:** This is crucial for responsive design, allowing elements inside to resize or move based on the Frame's size.\n3.  **Act as containers:** They mimic the behavior of artboards or HTML containers (like `<div>`s).\n\n**Groups** are simply for organizing layers together and do not have these layout properties."
        },
        "explanation": "Understanding Frames is the first step to mastering Figma. They are the building blocks of any layout."
    },
    {
        "title": "Figma Collaboration Features",
        "ques": "Describe two key **collaboration features** in Figma that make it suitable for team projects.",
        "answer": {
            "type": "text",
            "content": "1.  **Real-time Multiplayer Editing:** Multiple team members can work on the same file simultaneously, seeing each other's cursors and changes in real-time. This eliminates version control conflicts.\n2.  **Comments:** Team members and stakeholders can drop pins and leave comments directly on specific parts of the design to provide context-specific feedback."
        },
        "explanation": "Figma's browser-based nature revolutionized design by making collaboration seamless and real-time."
    },
    {
        "title": "Extending Functionality with Plugins",
        "ques": "What are **Figma Plugins**, and how can they enhance a designer's workflow? Give generic examples of what plugins can do.",
        "answer": {
            "type": "text",
            "content": "**Plugins** are third-party scripts or applications that run inside Figma to extend its functionality.\n\n**Enhancement:** They automate repetitive tasks, provide access to external data, or add new design capabilities.\n\n**Examples:**\n*   **Content Generation:** Inserting realistic dummy text or images.\n*   **Icon Libraries:** Quickly searching and dropping icons.\n*   **Accessibility Checks:** Checking color contrast ratios directly in the design."
        },
        "explanation": "The plugin ecosystem is vast. Knowing how to find and use plugins allows designers to work much faster."
    },
    {
        "title": "Prototyping in Figma",
        "ques": "Explain the concept of **Smart Animate** in Figma prototyping and what it is used for.",
        "answer": {
            "type": "text",
            "content": "**Smart Animate** is a prototyping feature that automatically creates smooth transitions between two frames.\n\n**How it works:** It looks for matching layers (by name and hierarchy) between the start and end frames and animates the differences (e.g., change in position, size, opacity, or color) rather than just fading or sliding the entire screen.\n\n**Use Case:** It is ideal for creating micro-interactions like toggles, button states, or expanding cards."
        },
        "explanation": "Smart Animate enables designers to create high-fidelity, app-like interactions without needing complex animation tools."
    }
]