[
    {
        "title": "Interactive Prototypes in InVision",
        "ques": "How does InVision allow you to transform static design images into **interactive prototypes**?",
        "answer": {
            "type": "text",
            "content": "InVision creates interactivity through **Hotspots**.\n\n**Process:**\n1.  You upload static screen images (exported from Sketch, Photoshop, etc.).\n2.  You draw clickable areas (Hotspots) over buttons or links.\n3.  You link these Hotspots to other destination screens.\n4.  You define the **transition type** (e.g., slide left, dissolve, push) and **gesture** (e.g., tap, swipe) to trigger the navigation."
        },
        "explanation": "This 'click-through' model is the simplest form of prototyping but highly effective for validating flows."
    },
    {
        "title": "User Testing",
        "ques": "Describe a typical **User Testing** workflow using InVision.",
        "answer": {
            "type": "text",
            "content": "InVision facilitates remote user testing via public share links.\n\n**Workflow:**\n1.  **Share:** The designer generates a public link to the prototype.\n2.  **Test:** The user opens the link on their device (or desktop) and attempts to complete a task.\n3.  **Feedback:** While navigating, users (or stakeholders) can leave comments on specific screens. Some versions allow for recording user sessions or using 'LiveShare' to present real-time."
        },
        "explanation": "Getting the prototype into the hands of real users quickly is InVision's core value proposition."
    },
    {
        "title": "Advanced Animations (Studio)",
        "ques": "In InVision Studio (the desktop tool), what is **Motion** and how does it differ from standard screen transitions?",
        "answer": {
            "type": "text",
            "content": "In InVision Studio, **Motion** refers to fine-grained, timeline-based animation.\n\n**Difference:** Unlike simple screen transitions (A to B), Studio allows for animating individual layers. You can define keyframes, easing curves, and staggered delays for elements entering the screen, creating complex micro-interactions that feel like a coded application."
        },
        "explanation": "Studio was built to bridge the gap between static design tools and motion graphics tools like After Effects."
    },
    {
        "title": "Version History",
        "ques": "Why is **Version History** important in a design collaboration tool like InVision?",
        "answer": {
            "type": "text",
            "content": "**Version History** maintains a log of previous iterations of a design screen.\n\n**Importance:**\n1.  **Backup:** It acts as a safety net, allowing designers to revert to an older design if a new direction fails.\n2.  **Comparison:** It helps track the evolution of a design and allows stakeholders to compare the current version with previous proposals to see what changed and why."
        },
        "explanation": "In iterative design, 'new' isn't always 'better'. Keeping a history preserves the decision-making process."
    }
]