[
    {
        "title": "High-Fidelity Prototypes",
        "ques": "What defines a **High-Fidelity (Hi-Fi) Prototype** and when is the appropriate time to build one?",
        "answer": {
            "type": "text",
            "content": "**Definition:** A Hi-Fi prototype is a computer-based interactive representation of the product that closely simulates the final user interface in terms of visuals, content, and interactivity.\n\n**When to build:** It is built **late in the design process**, after the general structure (wireframes) and flows have been validated. It is used for final usability testing and to give developers a precise reference for implementation."
        },
        "explanation": "Hi-Fi prototypes are expensive to build and change, so they should confirm, not explore, the design."
    },
    {
        "title": "User Flows",
        "ques": "What is a **User Flow** diagram?",
        "answer": {
            "type": "text",
            "content": "A **User Flow** is a visual representation (chart or diagram) that tracks the path a user takes through a product to achieve a specific goal.\n\nIt maps out every step, from the entry point (e.g., landing page) through a series of interactions (clicks, swipes) to the final outcome (e.g., purchase confirmation). It helps identify potential friction points and dead ends."
        },
        "explanation": "Designing the flow is designing the experience. The screens are just the steps in that journey."
    },
    {
        "title": "Micro-Interactions",
        "ques": "Define **Micro-interactions** and give two examples of how they improve user experience.",
        "answer": {
            "type": "text",
            "content": "**Micro-interactions** are small, subtle animations or feedback loops that accomplish a single task or communicate a specific status.\n\n**Examples:**\n1.  **Like Button:** The heart animation when you 'like' a post confirms the action and provides delight.\n2.  **Pull-to-Refresh:** The spinner animation when pulling down a list indicates that data is loading.\n\n**Improvement:** They make the interface feel responsive, alive, and intuitive by providing immediate feedback."
        },
        "explanation": "The difference between a good app and a great app is often in the details of its micro-interactions."
    },
    {
        "title": "Accessibility Tools",
        "ques": "Why should designers use **Accessibility Tools** (like contrast checkers) during the prototyping phase?",
        "answer": {
            "type": "text",
            "content": "Designers should use tools like **Contrast Checkers** (e.g., WCAG guidelines) to ensure text is readable for users with visual impairments.\n\n**Reason:** Checking accessibility during prototyping fixes fundamental issues (like color choices and font sizes) early. Retrofitting accessibility into a finished product is much harder and more expensive than designing it correctly from the start."
        },
        "explanation": "Accessibility is not a feature; it is a requirement. Inclusive design benefits everyone."
    }
]