[
    {
        "title": "Symbols (Components) in Sketch",
        "ques": "What is a **Symbol** in Sketch, and how does utilizing **Overrides** make them powerful for app design?",
        "answer": {
            "type": "text",
            "content": "**Symbol:** A reusable component (like a button, header, or icon) that fosters consistency. When you edit the 'master' Symbol, all instances update automatically.\n\n**Overrides:** Overrides allow you to customize specific content (text, images, or nested symbols) within an individual instance of a Symbol *without* detaching it from the master. This lets you use the same 'Card' Symbol for 100 different items with different data."
        },
        "explanation": "Symbols are the cornerstone of scalable design in Sketch. Overrides provide the necessary flexibility."
    },
    {
        "title": "Team Libraries",
        "ques": "Explain the purpose of **Libraries** in Sketch especially for a design team.",
        "answer": {
            "type": "text",
            "content": "**Libraries** allow a Sketch file to share its Symbols, Text Styles, and Layer Styles with other Sketch documents.\n\n**Purpose:**\n1.  **Single Source of Truth:** A team can maintain a central Design System file. Updates to that file (e.g., changing the brand color) can be pushed to all designers using that library.\n2.  **Consistency:** Ensures everyone uses the approved components and styles.\n3.  **Efficiency:** Designers don't have to recreate common elements."
        },
        "explanation": "Libraries turn individual design files into a connected ecosystem, essential for large-scale product development."
    },
    {
        "title": "App Design Workflow",
        "ques": "In Sketch, how do **Artboards** help in designing for an iOS application?",
        "answer": {
            "type": "text",
            "content": "**Artboards** represent the individual screens of the app.\n\n**Usage:**Sketch provides preset Artboard sizes for all Apple devices (e.g., iPhone 14, iPad Pro). Designers create a separate artboard for each screen in the user flow. They can organize these artboards on the infinite canvas to visualize the entire app journey."
        },
        "explanation": "Sketch was built specifically for this workflow, moving away from the 'page-based' model of print design."
    },
    {
        "title": "Resizing Constraints",
        "ques": "Describe how **Resizing Constraints** work in Sketch.",
        "answer": {
            "type": "text",
            "content": "**Resizing Constraints** tell Sketch how an object inside a group or artboard should behave when the parent is resized.\n\n**Options:**\n*   **Pin to edge:** Keeps the object at a fixed distance from a specific edge (Top, Right, Bottom, Left).\n*   **Fix Size:** Prevents the object's width or height from stretching.\n\n**Result:** This allows a single design to adapt reasonably well to slightly different screen widths without manual adjustment."
        },
        "explanation": "Constraints are the first step towards responsive design within a static design tool."
    }
]