[
    {
        "title": "Low-Fidelity Sketches",
        "ques": "What is the primary goal of **Low-Fidelity Sketching** (often with pen and paper) in the early design phase?",
        "answer": {
            "type": "text",
            "content": "The primary goal is **ideation and speed**.\n\nSketching allows designers to:\n1.  **Brainstorm:** Generate multiple concepts or layout variations quickly without software constraints.\n2.  **Dispose:** It lowers the attachment to ideas—bad ideas can be thrown away instantly, encouraging exploration.\n3.  **Communicate:** Facilitate quick discussions with stakeholders to align on the general direction."
        },
        "explanation": "Start rough, refine later. Sketching prevents 'pixel perfection' paralysis."
    },
    {
        "title": "Grid Systems",
        "ques": "Explain the importance of using a **Grid System** (e.g., the 12-column grid) in web design mockups.",
        "answer": {
            "type": "text",
            "content": "A **Grid System** provides a structured framework for arranging content.\n\n**Importance:**\n1.  **Alignment:** It ensures elements are aligned visually, creating a clean and organized layout.\n2.  **Consistency:** It maintains consistent spacing and margins across different pages.\n3.  **Responsiveness:** A 12-column grid translates easily to code (like Bootstrap or CSS Grid), making it easier for developers to implement responsive layouts for mobile (4 col), tablet (8 col), and desktop (12 col)."
        },
        "explanation": "Grids bring order to chaos. They are the invisible skeleton of every well-designed website."
    },
    {
        "title": "Choosing Color Palettes",
        "ques": "When selecting a **Color Palette** for a mockup, what is the '60-30-10 rule'?",
        "answer": {
            "type": "text",
            "content": "The **60-30-10 rule** is a classic interior design principle applied to UI design to create a balanced color scheme.\n\n*   **60% Primary Color:** The dominant color, usually a neutral background (white, light gray, etc.).\n*   **30% Secondary Color:** A supporting color used for cards, sidebars, or headers.\n*   **10% Accent Color:** A bold, vibrant color used strictly for calls-to-action (buttons, links) to guide user attention."
        },
        "explanation": "This rule helps prevented cluttered, rainbow-colored interfaces and ensures clear visual hierarchy."
    },
    {
        "title": "Typography Choices",
        "ques": "What is the difference between **Serif** and **Sans-Serif** fonts, and which is generally preferred for digital interfaces (UI)?",
        "answer": {
            "type": "text",
            "content": "*   **Serif Fonts:** Have small decorative strokes (feet) at the ends of letters (e.g., Times New Roman). They feel traditional and formal.\n*   **Sans-Serif Fonts:** Do NOT have these strokes (e.g., Arial, Roboto). They feel modern, clean, and minimal.\n\n**Preference:** **Sans-Serif** fonts are generally preferred for digital UIs because they remain legible at small sizes and lower screen resolutions compared to detailed serifs."
        },
        "explanation": "Typography sets the tone. For apps and dashboards, readability (Sans-Serif) usually trumps tradition."
    }
]