[
    {
        "title": "Nuxt.js Overview",
        "ques": "What is **Nuxt.js** and how does it relate to Vue.js?",
        "answer": {
            "type": "text",
            "content": "**Nuxt.js** is a higher-level framework built **on top of Vue.js**.\n\n**Purpose:** It simplifies the development of universal (SSR) Vue applications. It provides a standard directory structure, automatic routing (based on file structure), and built-in server-side rendering configuration, saving developers from complex Webpack/Server setups."
        },
        "explanation": "Nuxt is to Vue what Next.js is to React."
    },
    {
        "title": "Universal Rendering",
        "ques": "What is **Universal Rendering** (SSR + SPA) and what is its main SEO benefit?",
        "answer": {
            "type": "text",
            "content": "**Universal Rendering:** The initial page load is rendered on the **server** (sending full HTML to the client). Once loaded, the app 'hydrates' and becomes a standard Single Page Application (SPA) running in the browser.\n\n**SEO Benefit:** Search engine crawlers receive fully populated HTML content immediately, ensuring they can index the page content effectively, unlike a standard SPA which sends an empty `div`."
        },
        "explanation": "SSR is crucial for public-facing content sites where SEO matters."
    },
    {
        "title": "Hydration",
        "ques": "Define the term **Hydration** in the context of Server-Side Rendering.",
        "answer": {
            "type": "text",
            "content": "**Hydration** is the client-side process where Vue takes over the static HTML sent by the server.\n\n**Process:** The browser displays the static HTML immediately (fast Paint). Then, Vue loads its JavaScript, attaches event listeners to the existing DOM elements, and makes the page interactive. It 'hydrates' the dry, static HTML with dynamic functionality."
        },
        "explanation": "If hydration fails, you might see a 'flicker' where the layout shifts as the client-side code takes over."
    },
    {
        "title": "Static Site Generation (SSG)",
        "ques": "How does **Static Site Generation** (like `nuxt generate`) differ from dynamic Server-Side Rendering?",
        "answer": {
            "type": "text",
            "content": "*   **SSR:** The server renders the HTML **on-demand** for each request. (Good for dynamic data).\n*   **SSG:** The HTML is generated **at build time** (once). The server simply serves these pre-built static HTML files.\n\n**Advantage of SSG:** Extremely fast hosting (can be served via CDN) and impossible to hack via server logic."
        },
        "explanation": "SSG is perfect for blogs, documentation, and marketing pages."
    }
]