[
    {
        "title": "Qubit vs. Bit ⚛️",
        "ques": "Classical computers use Bits (0 or 1). What do Quantum Computers use, and what makes them special?",
        "answer": {
            "type": "text",
            "content": "**Qubits** (Quantum Bits). \nThanks to **Superposition**, a Qubit can exist in a state of 0, 1, or *both at the same time*. This allows performing multiple calculations simultaneously."
        },
        "explanation": "N qubits can represent 2^N states at once. The scaling is exponential."
    },
    {
        "title": "Entanglement 🕸️",
        "ques": "What is **Quantum Entanglement**?",
        "answer": {
            "type": "text",
            "content": "A phenomenon where two particles become linked. \nChanging the state of one particle *instantly* affects the state of the other, no matter how far apart they are (even light years). Einstein called this \"Spooky action at a distance\"."
        },
        "explanation": "This allows for instant correlation across the system."
    },
    {
        "title": "Encryption Threat 🔐",
        "ques": "Why is Quantum Computing considered a threat to modern encryption (RSA)?",
        "answer": {
            "type": "text",
            "content": "Available encryption relies on the fact that factoring large prime numbers is impossibly slow for classical computers. \n**Shor's Algorithm** running on a sufficiently powerful Quantum Computer could factor these numbers in minutes, breaking most current web security."
        },
        "explanation": "This is why NIST is currently standardizing **Post-Quantum Cryptography**."
    },
    {
        "title": "Quantum Supremacy 🏆",
        "ques": "What does the term **Quantum Supremacy** (or Advantage) mean?",
        "answer": {
            "type": "text",
            "content": "It refers to the milestone when a Quantum Computer can solve a problem that is practically **impossible** for even the most powerful classical Supercomputer to solve in a reasonable timeframe."
        },
        "explanation": "Google claimed this in 2019 with its Sycamore processor."
    },
    {
        "title": "Current State 🌡️",
        "ques": "Are Quantum Computers ready for hosting websites?",
        "answer": {
            "type": "text",
            "content": "**No.** Current machines are NISQ (Noisy Intermediate-Scale Quantum). They are error-prone, require near-absolute zero cooling, and are only good for specific optimization problems, not serving HTML."
        },
        "explanation": "It's for materials science and heavy math, not for running WordPress."
    }
]