[
    {
        "title": "Decentralization 🕸️",
        "ques": "Web3 is often called the \"Decentralized Web\". What is the main structural difference between Web2 and Web3?",
        "answer": {
            "type": "text",
            "content": "*   **Web2:** Read-Write. Data is stored on centralized servers owned by companies (Google, Facebook).\n*   **Web3:** Read-Write-Own. Data and logic live on a distributed blockchain network (like Ethereum) owned by no single entity."
        },
        "explanation": "Web3 gives users ownership of their digital assets (tokens/NFTs) without an intermediary."
    },
    {
        "title": "Smart Contracts 📜",
        "ques": "What is a **Smart Contract**? Does it require a lawyer?",
        "answer": {
            "type": "text",
            "content": "No lawyer needed. It is a self-executing computer program deployed on a blockchain. \nIt contains code (if-this-then-that logic). Once deployed, it runs exactly as programmed and cannot be stopped or censored by anyone."
        },
        "explanation": "Code is Law. It automates trust (e.g., automatically releasing funds when a task is done)."
    },
    {
        "title": "IPFS 📂",
        "ques": "Since storing large files (images/videos) on a Blockchain is expensive, where do Web3 apps typically store them?",
        "answer": {
            "type": "text",
            "content": "**IPFS** (InterPlanetary File System). \nIt is a peer-to-peer storage network. You upload a file, and it is addressed by its **Content Hash** (CID), not its location. If the content changes, the address changes."
        },
        "explanation": "IPFS ensures the file you look up is mathematically guaranteed to be the file you requested."
    },
    {
        "title": "Gas Fees ⛽",
        "ques": "Why do you have to pay **Gas Fees** to execute a write operation on Ethereum?",
        "answer": {
            "type": "text",
            "content": "To prevent spam and infinite loops. \nComputation on a decentralized network uses the resources of thousands of nodes. Gas is the fee paid to the validators/miners for their electricity and hardware usage to process your transaction."
        },
        "explanation": "It creates a market for computation. If the network is busy, gas prices go up."
    },
    {
        "title": "DApps 📱",
        "ques": "What is a **DApp** (Decentralized Application)? How does the frontend differ from a standard React app?",
        "answer": {
            "type": "text",
            "content": "The frontend is nearly identical (usually React/Vue). \nThe difference is the **Backend**. Instead of calling an HTTP API (`fetch('/api')`), the DApp uses a library like **Ethers.js** or **Web3.js** to call functions directly on a Smart Contract via an RPC provider."
        },
        "explanation": "DApps are just websites that talk to the blockchain."
    }
]