[
    {
        "title": "Lighthouse Audits 🏮",
        "ques": "What is **Google Lighthouse**? List the **four main categories** it scores your website on.",
        "answer": {
            "type": "text",
            "content": "**Google Lighthouse** is an automated, open-source tool for improving the quality of web pages. It runs an audit and provides scores in four key categories:\n1.  **Performance:** Speed metrics (LCP, TTI, etc.).\n2.  **Accessibility:** Adherence to WCAG standards (color contrast, ARIA).\n3.  **Best Practices:** Security, HTTPS, modern web standards.\n4.  **SEO:** Search engine optimization basics."
        },
        "explanation": "Lighthouse provides a comprehensive \"health check\" for web pages, offering actionable advice to improve **user experience** and **visibility**."
    },
    {
        "title": "Core Web Vitals 💓",
        "ques": "Define **LCP** (Largest Contentful Paint) and explain why it is a critical metric for user experience.",
        "answer": {
            "type": "text",
            "content": "*   **LCP (Largest Contentful Paint):** It measures the time it takes for the **largest visible content element** (usually a hero image or H1 tag) to be rendered on the screen.\n*   **Importance:** It marks the point when the main content of the page has likely loaded. A fast LCP (under 2.5s) reassures the user that the page is useful and loading correctly."
        },
        "explanation": "**Core Web Vitals** (LCP, FID/INP, CLS) are the subset of metrics that Google considers critical for all web experiences."
    },
    {
        "title": "WebPageTest Waterfalls 🌊",
        "ques": "When using **WebPageTest.org**, you see a \"Waterfall View\". What does a **long green bar** usually indicate in the request timeline?",
        "answer": {
            "type": "text",
            "content": "In WebPageTest, the green portion of a request bar typically represents the **sWait** or **Time to First Byte (TTFB)**. A long green bar means the browser sent the request and is **waiting** a long time for the server to start sending data back. This indicates a slow server-side process (e.g., slow DB query or heavy computation)."
        },
        "explanation": "Analyzing the colors in a waterfall chart helps distinguish between network issues (DNS lookup, connection) and **backend processing delays** (TTFB)."
    },
    {
        "title": "Cumulative Layout Shift (CLS) 🤸",
        "ques": "Explain **CLS** (Cumulative Layout Shift) with a user-centric example. How does specifying `width` and `height` attributes on images prevent poor CLS scores?",
        "answer": {
            "type": "text",
            "content": "*   **CLS:** Measures visual stability. It quantifies how much elements move around while the page loads.\n*   **Example:** A user tries to click \"Cancel\", but an image loads late, pushing the text down, causing them to accidentally click \"Confirm\".\n*   **Prevention:** Specifying `width` and `height` tells the browser exactly how much space to reserve **before** the image loads. This prevents the layout from jumping (shifting) when the image data arrives."
        },
        "explanation": "High CLS is incredibly frustrating. Pre-allocating space for dynamic content is the primary fix for maintaining a **stable visual layout**."
    },
    {
        "title": "Flame Charts in DevTools 🔥",
        "ques": "In the **Performance tab** of Chrome DevTools, what does the **Flame Chart** visualization display? What does it mean if you see a very **deep** stack of function calls?",
        "answer": {
            "type": "text",
            "content": "*   **Flame Chart:** It visualizes the call stack of JavaScript execution over time. The x-axis is time, and the y-axis is the call stack depth.\n*   **Deep Stack:** A very deep stack means function A called B, which called C ... which called Z. While normal, excessive depth or very wide bars (long duration) indicate heavy JS execution that might be blocking the main thread."
        },
        "explanation": "Flame charts allow you to drill down into exactly **which function** took the most time, enabling targeted optimization of JavaScript logic."
    }
]